books/deeply_understanding_digital_signal_processing.org
#+SETUPFILE: ~/.emacs.d/themes/org-html-themes/setup/theme-readtheorg.setup
#+OPTIONS: \n:t
#+OPTIONS: tex:t
#+STARTUP: latexpreview
#+OPTIONS: tex:dvipng
#+HTML_MATHJAX: align: left indent: 5em tagside: left font: Neo-Euler
#+attr_html: :width 300px
#+attr_latex: :width 300px
#+ATTR_ORG: :width 300

_*学以致用深入浅出数字信号处理*_

* 概述
  信号处理是为提取、增强、存储和传输有用信息而设计的一种运算。
  - 信号的采集，包括模／数变换技术、采样定理等。
  - 离散时间信号的分析，包括时域及频率分析、离散傅里叶变换等。
  - 离散系统的分析，包括差分方程、单位冲激响应、频率响应、Z变换等。
  - 信号处理中的快速算法，包括快速傅里叶变换、快速卷积与相关等。
  - 数字滤波技术，包括各种滤波器的设计与实现等。
  - 信号的建模，包括MA、AR及ARMA等各种模型。
  - 信号的传输与存储，包括信号的各种调制方式、压缩算法等。
  - 信号的检测与估计，包括信号的参数估计、波形估计、各种检测算法等。
  - 数字信号处理的实现，包括软件实现与硬件实现。
  - 数字信号处理的应用。
** 优点
   - 灵活性高
     当模拟系统的功能和性能发生改变时，必须重新进行系统设计，至少需要改变系统中的某些器件或参数，然后再重新装配和调试，
   - 可重复性好
     用同样的信号送入两个配置相同的模拟系统，输出的结果是不会一样的。
   - 稳定性好
   - 抗干扰性能好
   - 易于大规模集成
** 缺点
   - 处理带宽比较小
   - 动态范围不够大
   - 处理速度有待提高
** 三把key
   - 时域与频域的相互切换 - 傅里叶变换
     更多地在时域与频域之间来回切换，理解其中的物理意义，可以说是数字信号处理的一种基本思维方式.
   - 向量及向量坐标系
   - matlab
* 离散时间信号
  信号是携带有信息的物理量或物理现象，有限性与实值性。
** 分类
   - 确定信号与随机信号
   - 连续时间信号与离散时间信号
   - 模拟信号与数字信号
     数字信号（digitalsignal）是指在时间及幅度上都不连续的信号。
** 时域
   - 单位冲激信号
   - 单位阶跃信号
   - 脉冲信号
   - 正弦信号
   - 指数信号
** 基本运算
   相加，相减，累加，相乘，移位
** 噪声
   取决于信息是否需要
** 频域
   DTFT
** ADC
   采样，量化，编码
   数字信号处理 == 编码后比特流的处理
** *信号带宽*
   DFT后最高频率分量和最低频率分量之差
   - 在一个域的相乘等于另一个域的卷积
   - 与脉冲函数的卷积，在每个脉冲的位置上将产生一个波形的镜像。
   - https://www.cnblogs.com/h2zZhou/p/8405717.html
正弦波的叠加，也可以理解为螺旋线的叠加在实数空间的投影.

