books/deeply_understanding_digital_signal_processing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-29 Thu 19:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="xuali2" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org45e64b0">1. 概述</a>
<ul>
<li><a href="#orgae22016">1.1. 优点</a></li>
<li><a href="#org89cdee6">1.2. 缺点</a></li>
<li><a href="#org34dc94a">1.3. 三把key</a></li>
</ul>
</li>
<li><a href="#org9fc157c">2. 离散时间信号</a>
<ul>
<li><a href="#org9671f69">2.1. 分类</a></li>
<li><a href="#org7dfae95">2.2. 时域</a></li>
<li><a href="#org05316a1">2.3. 基本运算</a></li>
<li><a href="#orga754932">2.4. 噪声</a></li>
<li><a href="#orgd5b6472">2.5. 频域</a></li>
<li><a href="#orgad62529">2.6. ADC</a></li>
<li><a href="#org36136df">2.7. <b>信号带宽</b></a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<span class="underline"><b>学以致用深入浅出数字信号处理</b></span><br />
</p>

<div id="outline-container-org45e64b0" class="outline-2">
<h2 id="org45e64b0"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
信号处理是为提取、增强、存储和传输有用信息而设计的一种运算。<br />
</p>
<ul class="org-ul">
<li>信号的采集，包括模／数变换技术、采样定理等。<br /></li>
<li>离散时间信号的分析，包括时域及频率分析、离散傅里叶变换等。<br /></li>
<li>离散系统的分析，包括差分方程、单位冲激响应、频率响应、Z变换等。<br /></li>
<li>信号处理中的快速算法，包括快速傅里叶变换、快速卷积与相关等。<br /></li>
<li>数字滤波技术，包括各种滤波器的设计与实现等。<br /></li>
<li>信号的建模，包括MA、AR及ARMA等各种模型。<br /></li>
<li>信号的传输与存储，包括信号的各种调制方式、压缩算法等。<br /></li>
<li>信号的检测与估计，包括信号的参数估计、波形估计、各种检测算法等。<br /></li>
<li>数字信号处理的实现，包括软件实现与硬件实现。<br /></li>
<li>数字信号处理的应用。<br /></li>
</ul>
</div>
<div id="outline-container-orgae22016" class="outline-3">
<h3 id="orgae22016"><span class="section-number-3">1.1</span> 优点</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>灵活性高<br />
当模拟系统的功能和性能发生改变时，必须重新进行系统设计，至少需要改变系统中的某些器件或参数，然后再重新装配和调试，<br /></li>
<li>可重复性好<br />
用同样的信号送入两个配置相同的模拟系统，输出的结果是不会一样的。<br /></li>
<li>稳定性好<br /></li>
<li>抗干扰性能好<br /></li>
<li>易于大规模集成<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org89cdee6" class="outline-3">
<h3 id="org89cdee6"><span class="section-number-3">1.2</span> 缺点</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>处理带宽比较小<br /></li>
<li>动态范围不够大<br /></li>
<li>处理速度有待提高<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org34dc94a" class="outline-3">
<h3 id="org34dc94a"><span class="section-number-3">1.3</span> 三把key</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>时域与频域的相互切换 - 傅里叶变换<br />
更多地在时域与频域之间来回切换，理解其中的物理意义，可以说是数字信号处理的一种基本思维方式.<br /></li>
<li>向量及向量坐标系<br /></li>
<li>matlab<br /></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org9fc157c" class="outline-2">
<h2 id="org9fc157c"><span class="section-number-2">2</span> 离散时间信号</h2>
<div class="outline-text-2" id="text-2">
<p>
信号是携带有信息的物理量或物理现象，有限性与实值性。<br />
</p>
</div>
<div id="outline-container-org9671f69" class="outline-3">
<h3 id="org9671f69"><span class="section-number-3">2.1</span> 分类</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>确定信号与随机信号<br /></li>
<li>连续时间信号与离散时间信号<br /></li>
<li>模拟信号与数字信号<br />
数字信号（digitalsignal）是指在时间及幅度上都不连续的信号。<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org7dfae95" class="outline-3">
<h3 id="org7dfae95"><span class="section-number-3">2.2</span> 时域</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>单位冲激信号<br /></li>
<li>单位阶跃信号<br /></li>
<li>脉冲信号<br /></li>
<li>正弦信号<br /></li>
<li>指数信号<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org05316a1" class="outline-3">
<h3 id="org05316a1"><span class="section-number-3">2.3</span> 基本运算</h3>
<div class="outline-text-3" id="text-2-3">
<p>
相加，相减，累加，相乘，移位<br />
</p>
</div>
</div>
<div id="outline-container-orga754932" class="outline-3">
<h3 id="orga754932"><span class="section-number-3">2.4</span> 噪声</h3>
<div class="outline-text-3" id="text-2-4">
<p>
取决于信息是否需要<br />
</p>
</div>
</div>
<div id="outline-container-orgd5b6472" class="outline-3">
<h3 id="orgd5b6472"><span class="section-number-3">2.5</span> 频域</h3>
<div class="outline-text-3" id="text-2-5">
<p>
DTFT<br />
</p>
</div>
</div>
<div id="outline-container-orgad62529" class="outline-3">
<h3 id="orgad62529"><span class="section-number-3">2.6</span> ADC</h3>
<div class="outline-text-3" id="text-2-6">
<p>
采样，量化，编码<br />
数字信号处理 == 编码后比特流的处理<br />
</p>
</div>
</div>
<div id="outline-container-org36136df" class="outline-3">
<h3 id="org36136df"><span class="section-number-3">2.7</span> <b>信号带宽</b></h3>
<div class="outline-text-3" id="text-2-7">
<p>
DFT后最高频率分量和最低频率分量之差<br />
</p>
<ul class="org-ul">
<li>在一个域的相乘等于另一个域的卷积<br /></li>
<li>与脉冲函数的卷积，在每个脉冲的位置上将产生一个波形的镜像。<br /></li>
<li><a href="https://www.cnblogs.com/h2zZhou/p/8405717.html">https://www.cnblogs.com/h2zZhou/p/8405717.html</a><br /></li>
</ul>
<p>
正弦波的叠加，也可以理解为螺旋线的叠加在实数空间的投影.<br />
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: xuali2</p>
<p class="date">Created: 2020-10-29 Thu 19:24</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
